blog/m-player-multiple.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2015-11-23 Mon 15:14 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Listening To Multiple Media Streams On The Emacspeak Audio Desktop</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="T.V Raman" />
</head>
<body>
<div id="content">
<h1 class="title">Listening To Multiple Media Streams On The Emacspeak Audio Desktop</h1>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Executive Summary</h2>
<div class="outline-text-2" id="text-1">
<p>
The GitHub version of Emacspeak now supports launching and controlling
multiple media streams. This enables one to listen to the news while
playing a music stream, or relaxing nature sounds.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> Sample Usage</h2>
<div class="outline-text-2" id="text-2">
<p>
Here are some examples of using this feature:
</p>

<ol class="org-ol">
<li>Launch your favorite news station &#x2014; BBC World Service in my
case &#x2014; <span class="underline">C-e ; RET</span>.</li>
<li>Place the News on the left channel &#x2014; <span class="underline">C-e ; (</span>.</li>
<li>Persist the currently playing News stream by invoking command
<span class="underline">emacspeak-m-player-persist-stream</span> bound to <span class="underline">C-e ; \</span>. This lets
you launch a second stream via Emacspeak media key <span class="underline">C-e ;</span> rather
than controlling the currently playing stream.</li>
<li>Launch a classical music  media-stream  &#x2014; <span class="underline">C-e ; lu RET</span> for a lullaby
media stream.</li>
<li>Now Emacspeak M-Player commands will  control the most recently
launched stream;  you can once again invoke command
<span class="underline">emacspeak-m-player-persist-stream</span> if you  wish.</li>
<li>The previously launched (and still playing) News stream is now in a
buffer named <code>*Persistent-...*</code>. Command
<span class="underline">emacspeak-wizards-view-buffers-filtered-by-m-player-mode</span> can be
used to list   buffers that hold a live <code>m-player</code> instance. It is
bound to <span class="underline">b</span> in <code>emacspeak-m-player-mode</code>. I also bind this command
to <span class="underline">C-; ;</span> in my global keymap.</li>
<li>You can make  an M-Player instance <b>current</b> by switching to its
buffer and invoking command <span class="underline">emacspeak-m-player-restore-process</span>
bound to <span class="underline">/</span> in <code>emacspeak-m-player-mode</code>.</li>
</ol>
<p>
Share And Enjoy&#x2013;
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: <span class="timestamp-wrapper"><span class="timestamp">&lt;2015-11-23 Mon&gt;</span></span></p>
<p class="author">Author: T.V Raman</p>
<p class="date">Created: 2015-11-23 Mon 15:14</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
